app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
        <h5 class="card-title"><%= @gossip.title %></h5>
        <h6 class="card-subtitle mb-2 text-muted"> Auteur : <%= link_to "#{@gossip.user.first_name}", profil_path(@gossip.user.id)%></h6>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]
---
        <%if current_user%>
          <% pre_like = @gossip.likes.find { |like| like.user_id == current_user.id} %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]
---
          <%end%>
          <p><%= @gossip.likes.count %> <%= (@gossip.likes.count) == 1 ? 'Like' : 'Likes'%></p>

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
---
      <h2>Commentaires</h2>
        <% @gossip.comments.each do |comment|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <h5 class="card-title"><%= comment.content %></h5>
            <p class="card-text"><%= comment.user.first_name %></p>