app/controllers/cities_controller.rb

  def show
    @city = City.find(params[:id])
    @user_gossips = []
    @city.users.each do |user|
      user.gossips.each do |gossip|
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."city_id" = $1  [["city_id", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 3]]