app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", ""], ["user_id", 9], ["gossip_id", 1], ["created_at", "2020-02-12 16:03:08.913458"], ["updated_at", "2020-02-12 16:03:08.913458"]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def create
    @comment = Comment.create(content: params[:content], user: User.all.sample, gossip: Gossip.find(params[:gossip_id]))

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "test 1 2 1 2"], ["updated_at", "2020-02-12 16:24:08.672956"], ["id", 1]]
---
  def update
    @comment = Comment.find(params[:id])
    comment_params = params.require(:comment).permit(:content)

  if @comment.update(comment_params)