app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("content", "created_at", "updated_at", "title", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "inô"], ["created_at", "2020-02-11 15:56:44.480013"], ["updated_at", "2020-02-11 15:56:44.480013"], ["title", "Salam"], ["user_id", 40]]
---
  def create
      @gossip = Gossip.new(title: params[:title], content: params[:content], user: current_user)
      if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "blalaba"], ["updated_at", "2020-02-12 12:17:27.899305"], ["id", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])
    gossip_params = params.require(:gossip).permit(:title, :content)

  if @gossip.update(gossip_params)