app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["gossip_id", 1], ["created_at", "2020-02-13 14:57:04.243876"], ["updated_at", "2020-02-13 14:57:04.243876"]]
---
  def create
    if already_liked?
      flash[:notice] = "You can't like more than once"
    else
      @gossip.likes.create(user_id: current_user.id)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    if !(already_liked?)
      flash[:notice] = "Cannot unlike"
    else
      @like.destroy

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_gossip
    @gossip = Gossip.find(params[:gossip_id])

SELECT  "likes".* FROM "likes" WHERE "likes"."gossip_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["gossip_id", 1], ["id", 5], ["LIMIT", 1]]
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."gossip_id" = $2 LIMIT $3  [["user_id", 1], ["gossip_id", 1], ["LIMIT", 1]]
---
  def already_liked?
    Like.where(user_id: current_user.id, gossip_id: params[:gossip_id]).exists?

SELECT  "likes".* FROM "likes" WHERE "likes"."gossip_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["gossip_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def find_like
    @like = @gossip.likes.find(params[:id])