app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "acastelbou1@gmail.com"], ["LIMIT", 1]]
---
  def create
    puts "aaaaaaa"
    puts User.first.first_name
    puts "aaaaaaaa"
    puts User.first.email
    puts params[:email]
    user = User.find_by(email: params[:email])