app/controllers/show_user_controller.rb

  def profil
    @user = User.find(params[:id])
    @user_gossips = []
    Gossip.all.each do |gossip|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"