app/controllers/users_controller.rb

SELECT "cities".* FROM "cities"
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Paris"], ["created_at", "2020-02-13 14:04:25.304965"], ["updated_at", "2020-02-13 14:04:25.304965"]]
INSERT INTO "users" ("first_name", "age", "created_at", "updated_at", "city_id", "password_digest", "email") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    city = params[:city]
    City.all.each do |old_city|
      if old_city.name.downcase == city.downcase
        city = old_city
      end
    end

    city = City.new(name: params[:city].capitalize) if city == params[:city]

    @user = User.new(first_name: params[:first_name], last_name: params[:last_name], age: params[:age], city: city, password: params[:password], password_confirmation: params[:password_confirmation], email: params[:email] )
    if @user.save