app/views/show_user/profil.html.erb

          <div class="card-body">
            <h6 class="card-subtitle mb-2 text-muted text-center"><%= link_to "#{gossip.user.first_name}", profil_path(gossip.user.id)%></h6>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

        <%if current_user%>
          <% pre_like = gossip.likes.find { |like| like.user_id == current_user.id} %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]

          <%end%>
          <p ><%= gossip.likes.count %> <%= (gossip.likes.count) == 1 ? 'Like' : 'Likes'%></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]