app/models/user.rb

UPDATE "users" SET "remember_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["remember_digest", "$2a$12$7lzE.r/f5wh113cSq2iOPuShZxdP5wvLLjPGkDlFUzqTI2mCVnx0G"], ["updated_at", "2020-02-14 13:07:04.926903"], ["id", 1]]
---
  def remember(remember_token)
    remember_digest = BCrypt::Password.create(remember_token)
    self.update(remember_digest: remember_digest)